ack
ansible
argo
atk
autoconf
automake
awscli
azure-cli
cairo
cask
circleci
cmigemo
colordiff
coreutils
curl
direnv
docker
doxygen
emacs
fontconfig
freetype
fribidi
fzf
gawk
gcc
gdbm
gdk-pixbuf
gettext
gibo
git
git-review
git-ssh
glib
gmp
gnu-sed
gnutls
go
graphite2
gtk+
harfbuzz
hicolor-icon-theme
htop
httpie
httping
hub
icu4c
iperf
iproute2mac
isl
jpeg
jq
kops
ks
kubectx
kubernetes-cli
kubernetes-helm
libevent
libffi
libidn2
libmpc
libpng
libtasn1
libtiff
libunistring
libyaml
lua
mosh
mpfr
mysql
mysql-client
ncurses
nettle
nmap
node
node-build
nodenv
oniguruma
openssh
openssl
p11-kit
packer
pango
pcre
pcre2
peco
perl
pipenv
pixman
pkg-config
protobuf
pstree
py2cairo
pyenv
pyenv-virtualenv
pygobject
pygtk
python
python@2
rbenv
readline
reattach-to-user-namespace
redis
ruby
ruby-build
skaffold
sqlite
sshfs
sshrc
stern
tcl-tk
terraform
tfschema
tig
tmux
tree
unar
unbound
vim
wget
xz
yarn
zlib
zplug
zsh
zsh-completions
zsh-history-substring-search
