tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
cask 'java'
brew 'android-sdk'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'apktool'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'bison'
brew 'git'
brew 'go'
brew 'docker'
brew 'boot2docker'
brew 'colordiff'
brew 'ctags'
brew 'dex2jar'
brew 'pkg-config'
brew 'libtool'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'freetype'
brew 'imagemagick'
brew 'emacs'
brew 'gawk'
brew 'gdbm'
brew 'git-review'
brew 'git-ssh'
brew 'heroku-toolbelt'
brew 'hub'
brew 'oniguruma'
brew 'jq'
brew 'juju'
brew 'libevent'
brew 'protobuf'
brew 'mobile-shell'
brew 'mysql'
brew 'nmap'
brew 'node'
brew 'peco'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'rbenv-gemset'
brew 'ruby-build'
brew 'rbenv-readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'scons'
brew 'smali'
brew 'stow'
brew 'subversion'
brew 'terraform'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'caskroom/cask/brew-cask'
cask 'alfred'
cask 'amazon-workspaces'
cask 'amethyst'
cask 'android-studio'
cask 'appcleaner'
cask 'atom'
cask 'bettertouchtool'
cask 'boot2docker-status'
cask 'caffeine'
cask 'coteditor'
cask 'filezilla'
cask 'firefox'
cask 'flash'
cask 'flash-player'
cask 'font-ricty-diminished'
cask 'font-source-code-pro'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-powerline'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'google-hangouts'
cask 'google-japanese-ime'
cask 'hipchat'
cask 'iterm2'
cask 'jd-gui'
cask 'karabiner'
cask 'keka'
cask 'kobito'
cask 'kobo'
cask 'mou'
cask 'mplayerx'
cask 'skype'
cask 'slack'
cask 'slicy'
cask 'sourcetree'
cask 'spotify'
cask 'teamviewer'
cask 'teleport'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'vagrant'
cask 'vagrant-manager'
cask 'viber'
cask 'virtualbox'
cask 'weka'
