tap "argoproj/tap"
tap "bazelbuild/tap"
tap "datawire/blackbird"
tap "derailed/k9s"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "int128/kubelogin"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "ksonnet/tap"
tap "minamijoyo/tfschema"
tap "minio/stable"
tap "rcmdnk/file"
tap "talal/tap"
tap "weaveworks/tap"
cask "osxfuse"
brew "ack"
brew "archey"
brew "argo"
brew "argocd"
brew "aspell"
brew "pcre"
brew "readline"
brew "xz"
brew "glib"
brew "python@3.8"
brew "atk"
brew "autoconf"
brew "autojump"
brew "automake"
brew "aws-iam-authenticator"
brew "awscli"
brew "bazaar"
brew "freetype"
brew "cairo"
brew "libtool"
brew "pkg-config"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs", link: false
brew "cask"
brew "llvm"
brew "ccls"
brew "clang-format"
brew "cmake"
brew "cmigemo"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker"
brew "libyaml"
brew "docker-compose"
brew "fd"
brew "isl"
brew "gcc"
brew "hwloc"
brew "fftw"
brew "fzf"
brew "gawk"
brew "gd"
brew "gerrit-tools", link: false
brew "gh"
brew "gibo"
brew "git"
brew "git-review"
brew "git-ssh"
brew "glances"
brew "go"
brew "glide"
brew "global"
brew "gnu-sed"
brew "gnu-units"
brew "gnupg"
brew "gobject-introspection"
brew "harfbuzz"
brew "helm"
brew "ncurses"
brew "htop"
brew "httping"
brew "hub"
brew "imagemagick"
brew "iproute2mac"
brew "ispell"
brew "jasper"
brew "openjdk"
brew "javacc"
brew "librsvg"
brew "libxml2"
brew "node"
brew "nss"
brew "qt"
brew "poppler"
brew "vips"
brew "joplin"
brew "jq"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "ldns"
brew "loc"
brew "markdown"
brew "mas"
brew "mysql-client"
brew "ncdu"
brew "netpbm"
brew "nmap"
brew "node-build"
brew "nodenv"
brew "openssh"
brew "peco"
brew "perl"
brew "pipenv"
brew "protobuf"
brew "prototool"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "rtags"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "shellcheck"
brew "skaffold"
brew "sshfs"
brew "sshrc"
brew "starship"
brew "stern"
brew "tcl-tk"
brew "terraforming"
brew "texinfo"
brew "tfenv"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "unar"
brew "unison"
brew "vim"
brew "watch"
brew "wget"
brew "wifi-password"
brew "zlib"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "derailed/k9s/k9s"
brew "int128/kubelogin/kubelogin"
brew "knqyf263/pet/pet"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "ksonnet/tap/ks"
brew "minamijoyo/tfschema/tfschema"
brew "minio/stable/mc"
brew "minio/stable/minio"
brew "rcmdnk/file/brew-file"
brew "weaveworks/tap/eksctl"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alfred"
cask "alternote"
cask "appcleaner"
cask "balenaetcher"
cask "bettertouchtool"
cask "boostnote"
cask "brave-browser"
cask "coteditor"
cask "disk-inventory-x"
cask "elmedia-player"
cask "emacs-nightly"
cask "emacsclient"
cask "firefox"
cask "font-envy-code-r"
cask "font-hack-nerd-font"
cask "font-powerline-symbols"
cask "font-ricty-diminished"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-han-code-jp"
cask "font-source-han-mono"
cask "font-ubuntu"
cask "font-ubuntu-mono-derivative-powerline"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "iterm2"
cask "jira-client"
cask "journey"
cask "karabiner-elements"
cask "keka"
cask "latexit"
cask "mendeley"
cask "mightytext"
cask "onedrive"
cask "openemu"
cask "openwebstart"
cask "pritunl"
cask "resolutionator"
cask "skype"
cask "slack"
cask "softu2f"
cask "spectacle"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
cask "zoomus"
mas "Apple Configurator 2", id: 1037126344
mas "Artpaper", id: 1028838684
mas "Evernote", id: 406056744
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Pocket", id: 568494494
mas "Xcode", id: 497799835
